In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'2.0.3'

In [39]:
## Data Frame --> Is an in-memory data structure, It will be used to evaluate the data structure efficiently
## Keys of a dictionary are column names in the dataframe
## All values of dictionary of same length
## Data Frame will have an index. Rows--> Starts from 0, but Index can be provided
## Every column in a dataframe is called a pandas Series. --> Numpy array. --> Same Data type
## Normal indexing for a dataframe will extract columns instead rows
## Pandas is always a 2D Array
## 2 Types Indexing:
## index location(iloc), location(loc)

In [6]:
students = {"Name":["Rajesh","Vinod","Guffran","Laxmi","Prasanna","SaiKrishna"]}

In [7]:
students

{'Name': ['Rajesh', 'Vinod', 'Guffran', 'Laxmi', 'Prasanna', 'SaiKrishna']}

In [8]:
type(students)

dict

In [9]:
students_df = pd.DataFrame(students)

In [11]:
students_df

         Name
0      Rajesh
1       Vinod
2     Guffran
3       Laxmi
4    Prasanna
5  SaiKrishna

In [11]:
students_df.index = range(1,7)

In [12]:
students_df

         Name
1      Rajesh
2       Vinod
3     Guffran
4       Laxmi
5    Prasanna
6  SaiKrishna

In [15]:
names = students_df["Name"]

In [16]:
type(students_df),type(names)

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [18]:
pd.DataFrame(names)

         Name
0      Rajesh
1       Vinod
2     Guffran
3       Laxmi
4    Prasanna
5  SaiKrishna

In [19]:
## Every series is of same type.

In [21]:
values = [1,2,3,"Tharun","Kumar",4,5]

In [22]:
values[0]

1

In [21]:
type(values)

list

In [22]:
type(values[0])

int

In [27]:
pd.Series(values)

0         1
1         2
2         3
3    Tharun
4     Kumar
5         4
6         5
dtype: object

In [30]:
np.array(values)

array(['1', '2', '3', 'Tharun', 'Kumar', '4', '5'], dtype='<U21')

In [14]:
info = {"Name":["Rajesh","Ramu","Raju"], "Age":[22,24,25],"Gender":["male","male","male"]}

In [15]:
info

{'Name': ['Rajesh', 'Ramu', 'Raju'],
 'Age': [22, 24, 25],
 'Gender': ['male', 'male', 'male']}

In [43]:
info_df = pd.DataFrame(info)
info_df

     Name  Age Gender
0  Rajesh   22   male
1    Ramu   24   male
2    Raju   25   male

In [42]:
info_df.to_numpy()[:3,:2]

array([['Rajesh', 22],
       ['Ramu', 24],
       ['Raju', 25]], dtype=object)

In [41]:
info_df.iloc[:3,:2]

     Name  Age
0  Rajesh   22
1    Ramu   24
2    Raju   25

In [44]:
info_df.loc[:3,["Name","Gender"]]

     Name Gender
0  Rajesh   male
1    Ramu   male
2    Raju   male

In [47]:
info_df.loc[1:,["Age","Gender"]]

   Age Gender
1   24   male
2   25   male

In [46]:
info_df.iloc[1:,1:]

   Age Gender
1   24   male
2   25   male

In [49]:
info_df[['Age','Gender']].loc[1:]

   Age Gender
1   24   male
2   25   male

In [33]:
info_df["Age"]

0    22
1    24
2    25
Name: Age, dtype: int64

In [34]:
info_df.iloc[2]

Name      Raju
Age         25
Gender    male
Name: 2, dtype: object

In [51]:
info_df.to_csv("info.csv")

In [53]:
info_df.to_excel("info.xlsx")

In [35]:
info_array = info_df.to_numpy()
info_array.shape

(3, 3)

In [36]:
info_array

array([['Rajesh', 22, 'male'],
       ['Ramu', 24, 'male'],
       ['Raju', 25, 'male']], dtype=object)

In [37]:
info_array[1:2]

array([['Ramu', 24, 'male']], dtype=object)

In [38]:
info_array[1:,1:]

array([[24, 'male'],
       [25, 'male']], dtype=object)

In [44]:
info_df.columns.to_list()

['Name', 'Age', 'Gender']

In [46]:
info_df

     Name  Age Gender
0  Rajesh   22   male
1    Ramu   24   male
2    Raju   25   male

In [50]:
info_df["Name"]

0    Rajesh
1      Ramu
2      Raju
Name: Name, dtype: object

In [45]:
info_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [51]:
list(range(0,3))

[0, 1, 2]

In [54]:
info_df.describe() ## Statistical Details --> Measure of central tendency, Quartile details ## describe will only work for integer or float data typed columns

             Age
count   3.000000
mean   23.666667
std     1.527525
min    22.000000
25%    23.000000
50%    24.000000
75%    24.500000
max    25.000000

In [56]:
info_df.head(2)

     Name  Age Gender
0  Rajesh   22   male
1    Ramu   24   male

In [57]:
info_df.tail(2)

   Name  Age Gender
1  Ramu   24   male
2  Raju   25   male

In [58]:
from datetime import datetime as dt

In [59]:
dt.now()

datetime.datetime(2023, 11, 17, 20, 12, 8, 650740)

In [64]:
help(dt.strftime)

Help on method_descriptor:

strftime(...)
    format -> strftime() style string.

In [88]:
type(dt.now())

datetime.datetime

In [87]:
dt.strftime(dt.now(),format="%d-%m-%y")

'17-11-23'

In [74]:
dt.strftime(dt.now(),format="%d-%m-%y")

'17-11-23'

In [85]:
dt.now().date() -

TypeError: descriptor 'date' for 'datetime.datetime' objects doesn't apply to a 'str' object

In [76]:
import time

In [80]:
dir(dt)

['__add__',
 '__class__',
 '__delattr__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__ne__',
 '__new__',
 '__radd__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rsub__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 'astimezone',
 'combine',
 'ctime',
 'date',
 'day',
 'dst',
 'fold',
 'fromisocalendar',
 'fromisoformat',
 'fromordinal',
 'fromtimestamp',
 'hour',
 'isocalendar',
 'isoformat',
 'isoweekday',
 'max',
 'microsecond',
 'min',
 'minute',
 'month',
 'now',
 'replace',
 'resolution',
 'second',
 'strftime',
 'strptime',
 'time',
 'timestamp',
 'timetuple',
 'timetz',
 'today',
 'toordinal',
 'tzinfo',
 'tzname',
 'utcfromtimestamp',
 'utcnow',
 'utcoffset',
 'utctimetuple',
 'weekday',
 'year']

In [54]:
titanic_df = pd.read_csv("tested.csv")

In [55]:
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

NameError: name 'nan' is not defined

In [82]:
if np.isnan(titanic_df["Age"].iloc[413]):
    print("hello")

hello

In [99]:
notnans = 0
for value in titanic_df["Age"]:
    if not np.isnan(value):
        notnans += 1
notnans

332

In [100]:
titanic_df["Age"].notna().sum()

332

In [101]:
total_nans = 0
for column in titanic_df.columns:
    total_nans += titanic_df[column].isna().sum()

In [102]:
total_nans

414

In [111]:
titanic_df.isna().sum().sum()

414